Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаставникСтажер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стажеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Наставники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/Роли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>Роли</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наставник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стажер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи/Ext/ObjectModule.bsl
Перем ПарольПользователя Экспорт;

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда  // если пользователь только создается
	
		// создаем нового пользователя в служебном справочнике пользователей
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		
	Иначе 
		
		// находим пользователя по имени в служебном справочнике пользоваелей
		НовыйПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Код);
		
		//если не удалось найти пользователя, значит имя пользователя поменяли
		Если НовыйПользователь = Неопределено Тогда
			
		    Отказ = Истина;
			сообщить("Имя пользователя менять в пользовательском режиме нельзя. Поменяйте имя в конфигураторе, а потом в справочнике");
			Возврат;
			
		КонецЕсли;
	
	КонецЕсли;
	
	// в переменную записываем данные из формы
	НовыйПользователь.Имя = ЭтотОбъект.Наименование;
	Если Роль = Перечисления.Роли.Администратор Тогда
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
	ИначеЕсли Роль = Перечисления.Роли.Наставник Тогда 
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.Наставник);
	ИначеЕсли Роль = Перечисления.Роли.Стажер Тогда
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.Стажер);
	КонецЕсли;
	НовыйПользователь.ПолноеИмя = ЭтотОбъект.Наименование;
	
	НовыйПользователь.Пароль = ПарольПользователя;
	НовыйПользователь.АутентификацияСтандартная = Истина;	
	НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
	НовыйПользователь.Язык = Метаданные.Языки.Русский;
	
	// записываем результат изменений
	НовыйПользователь.Записать(); 

КонецПроцедуры
